ACHIEVMENTS_LIST = {
    "badge_1": "Значок Разработчика",
    "badge_2": "Значок Команды Аврора",
    "badge_3": "Золотые крылья",
    "badge_4": "Магнат",
    "badge_5": "Благочестивый",
    "badge_6": "Тестировщик",
    "badge_7": "Охотник за Багами",
    "badge_8": "Божество",
    "badge_9": "Любовь",
}

ACHIEVMENTS_DESCRIPTION = {
    "badge_1": "Уникальный значок Разработчика бота Аврора",
    "badge_2": "Уникальный значок участника команды бота Аврора",
    "badge_3": "Ну точно человек на сервере не первый день! Проведите в голосовых каналах сервера 100 часов, "
    "напишите 1000 сообщений и достигните 10 уровня.",
    "badge_4": "Накопите свой первый миллион валюты!",
    "badge_5": "Достигните 5-го уровня чести у бота Аврора!",
    "badge_6": "Уникальный значок пользователей-тестировщиков Авроры",
    "badge_7": "Найдите хотя бы 3 бага в нашем боте и получите уникальный значок!",
    "badge_8": "Прекрати фармить лес, а лучше выиграй 100 дуэлей!",
    "badge_9": "Будьте с кем-нибудь парочкой!",
}

OUR_TEAM = (
    86452644847030272,
    314618320093577217,
    731536872165343303,
    833941106436866048,
    584762244995350528,
)
DEVELOPERS = (314618320093577217, 731536872165343303)

TESTERS = (
    86452644847030272,
    314618320093577217,
    731536872165343303,
    833941106436866048,
    584762244995350528,
    872426591135875102,
    584762244995350528,
    639996422627917844,
    851807660952911882,
)
BUG_HUNTERS = (
    314618320093577217,
    731536872165343303,
    872426591135875102,
    584762244995350528,
)

TESTERS = (
    86452644847030272,
    314618320093577217,
    731536872165343303,
    833941106436866048,
    584762244995350528,
    872426591135875102,
    584762244995350528,
)
BUG_HUNTERS = (
    314618320093577217,
    731536872165343303,
    872426591135875102,
    584762244995350528,
)
